# pandas基本数据结构

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# Series：通过一维数组创建

In [4]:
# 格式为索引index+数据values+元素数据类型
arr=np.array([1,3,5,np.NaN,10])
series01=Series(arr)
series01

0     1.0
1     3.0
2     5.0
3     NaN
4    10.0
dtype: float64

In [5]:
series01.dtype   # 元素数据类型

dtype('float64')

In [6]:
series01.index   # 索引

RangeIndex(start=0, stop=5, step=1)

In [7]:
series01.values   # 数据

array([ 1.,  3.,  5., nan, 10.])

In [8]:
'''
    通过数组创建Series的时候，如果没有为数据指定索引的话，
    会自动创建一个从0到N-1的整数索引；
    当Series对象创建好后，可以通过index修改索引值
'''
series02=Series([87,90,89])
series02

0    87
1    90
2    89
dtype: int64

In [9]:
series02.index=['语文','数学','英语']
series02

语文    87
数学    90
英语    89
dtype: int64

In [10]:
series03=Series(data=[87,90,89],dtype=np.float64,index=['语文','数学','英语'])
series03   # 明确给定数据类型以及索引值

语文    87.0
数学    90.0
英语    89.0
dtype: float64

# Series：通过字典的方式创建

In [4]:
'''
    通过字典创建Series时，字典中的key组成Series中的索引，
    字典中的values组成Series中的values
'''
dic={
    'a':1,
    'b':2,
    'c':3,
    'd':4
}
ser=Series(dic)
ser

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
# 使用字段创建
dict1={
    '20170801':6875.0,'20170802':1239.2,'20170803':9456.2
}
series04=Series(dict1)
print(series04)
print('index:',series04.index)
print('values:',series04.values)
print('dtype:',series04.dtype)

20170801    6875.0
20170802    1239.2
20170803    9456.2
dtype: float64
index: Index(['20170801', '20170802', '20170803'], dtype='object')
values: [6875.  1239.2 9456.2]
dtype: float64

# Series值的获取

In [21]:
series=Series(data=[89,87,85],index=['语文','数学','英语'])
print(series)
print()
print("series['语文']=",series['语文'])
print('series[0]=',series[0])
print('series[-1]=',series[-1])
print()
print(series[1:])
print()
print(series[['语文','数学']])

语文    89
数学    87
英语    85
dtype: int64

series['语文']= 89
series[0]= 89
series[-1]= 85

数学    87
英语    85
dtype: int64

语文    89
数学    87
dtype: int64

In [25]:
# 按索引修改数据
series['语文']=321
print(series)

语文    321
数学     87
英语     85
dtype: int64

In [26]:
# 按下标修改数据
series[0]=11
series[-1]=123
print(series)

语文     11
数学     87
英语    123
dtype: int64

# Series的运算

In [29]:
series1=Series({
    '20170801':6875.0,
    '20170802':1239.2,
    '20170803':9456.2
})
print(series)
print()
print(series[series>5000])
print()
print(series/100)

20170801    6875.0
20170802    1239.2
20170803    9456.2
dtype: float64

20170801    6875.0
20170803    9456.2
dtype: float64

20170801    68.750
20170802    12.392
20170803    94.562
dtype: float64

In [31]:
series2=Series([-1,-2,3,4])
print(series2)
print()
print(np.exp(series2))   # 取自然对数
print()
print(np.fabs(series2))  # 取绝对值

0   -1
1   -2
2    3
3    4
dtype: int64

0     0.367879
1     0.135335
2    20.085537
3    54.598150
dtype: float64

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [15]:
series3=Series(np.random.randint(-9,9,5),index=list('abcdm'))
print(series3)
print(series3>3)
print(series3/2)
print(np.fabs(series3))
print(np.square(series3))

a   -7
b   -8
c   -9
d   -6
m    3
dtype: int32
a    False
b    False
c    False
d    False
m    False
dtype: bool
a   -3.5
b   -4.0
c   -4.5
d   -3.0
m    1.5
dtype: float64
a    7.0
b    8.0
c    9.0
d    6.0
m    3.0
dtype: float64
a    49
b    64
c    81
d    36
m     9
dtype: int32

# Series缺失值检测

In [17]:
ser01=Series([2,55,6,7,8],index=['a','b','c','d','e'])
ser01

a     2
b    55
c     6
d     7
e     8
dtype: int64

In [18]:
nex_index=['a','b','c','d','e','f']
ser02=Series(ser01,index=nex_index)
ser02

a     2.0
b    55.0
c     6.0
d     7.0
e     8.0
f     NaN
dtype: float64

In [5]:
# NaN(Not a Number)在pandas中用于表示一个缺失值或者NA值
scores=Series({
    'Tom':89,
    'John':88,
    'Merry':96,
    'Max':65
})
print(scores)
print()
new_index=['Tom','Max','Joe','John','Merry']
scores=Series(scores,index=new_index)
print(scores)

Tom      89
John     88
Merry    96
Max      65
dtype: int64

Tom      89.0
Max      65.0
Joe       NaN
John     88.0
Merry    96.0
dtype: float64

In [6]:
'''
    pandas中的isnull和notnull两个函数可以用于在Series中检测缺失值，
    这两个函数的返回的是一个布尔类型的Series
'''
pd.isnull(scores)

Tom      False
Max      False
Joe       True
John     False
Merry    False
dtype: bool

In [7]:
pd.notnull(scores)

Tom       True
Max       True
Joe      False
John      True
Merry     True
dtype: bool

In [8]:
# 过滤出为缺失值的项
scores[pd.isnull(scores)]

Joe   NaN
dtype: float64

In [9]:
# 过滤出为缺失值的项
scores[pd.notnull(scores)]

Tom      89.0
Max      65.0
John     88.0
Merry    96.0
dtype: float64

In [11]:
scores['Joe']=-1  # 通过索引对数据进行修改
print(scores)

Tom      89.0
Max      65.0
Joe      -1.0
John     88.0
Merry    96.0
dtype: float64

# Series自动对齐

In [12]:
'''
     当多个series对象之间进行运算的时候，
     如果不同series之间具有不同的索引值，那么运算会自动对齐相同索引值的数据，
     如果某个series没有某个索引值，那么最终结果会赋值为NaN。
'''
s1=Series([12,23,45],index=['p1','p2','p3'])
s2=Series([54,43,32,21],index=['p2','p3','p4','p5'])
print('=====s1+s2=====')
print(s1+s2)
print('=====s1*s2=====')
print(s1*s2)
print('=====s1/s2=====')
print(s1/s2)

=====s1+s2=====
p1     NaN
p2    77.0
p3    88.0
p4     NaN
p5     NaN
dtype: float64
=====s1*s2=====
p1       NaN
p2    1242.0
p3    1935.0
p4       NaN
p5       NaN
dtype: float64
=====s1/s2=====
p1         NaN
p2    0.425926
p3    1.046512
p4         NaN
p5         NaN
dtype: float64

In [16]:
s3=Series(np.random.randint(1,9,4),index=list('abcm'))
s4=Series(np.random.randint(1,9,5),index=list('abcdn'))
print('=====s3+s4=====')
print(s3+s4)
print('=====s3*s4=====')
print(s3*s4)
print('=====s3/s4=====')
print(s3/s4)

=====s3+s4=====
a    7.0
b    9.0
c    8.0
d    NaN
m    NaN
n    NaN
dtype: float64
=====s3*s4=====
a     6.0
b    18.0
c    15.0
d     NaN
m     NaN
n     NaN
dtype: float64
=====s3/s4=====
a    6.0
b    0.5
c    0.6
d    NaN
m    NaN
n    NaN
dtype: float64

# Series及其索引的name属性

In [13]:
'''
    Series对象本身以及索引都具有一个name属性，默认为空，根据需要可以进行赋值操作
'''
scores=Series({'Tom':89,'John':88,'Merry':96,'Max':65})
scores.name='语文'
scores.index.name='考试成绩'
print(scores)

考试成绩
Tom      89
John     88
Merry    96
Max      65
Name: 语文, dtype: int64

# DataFrame: 通过二维数组创建

In [15]:
# 通过嵌套列表创建，注意有缺省值的情况
df01=DataFrame([
    ['Tom','Gerry','John'],
    [76,98,85]
])
print(df01)

     0      1     2
0  Tom  Gerry  John
1   76     98    85

In [17]:
# 格式为行索引index+列索引columns+数据values
df02=DataFrame([
    ['Tom',76],
    ['Gerry',98],
    ['John',85]
],columns=['姓名','成绩'])
print(df02)
print('列索引',df02.columns)
print('行索引',df02.index)
print('数据',df02.values)

      姓名  成绩
0    Tom  76
1  Gerry  98
2   John  85
列索引 Index(['姓名', '成绩'], dtype='object')
行索引 RangeIndex(start=0, stop=3, step=1)
数据 [['Tom' 76]
 ['Gerry' 98]
 ['John' 85]]

In [19]:
# 通过np.array()创建，可以自定义行列
arr=np.array([
    ['Tom',76],
    ['Gerry',98],
    ['John',85]
])
df03=DataFrame(      
    arr,                # 自定义索引值
    index=['one','two','three'],
    columns=['name','score']
)
print(df03)

        name score
one      Tom    76
two    Gerry    98
three   John    85

In [19]:
# 注意使用字典创建时arrays must all be same length
dic={
    'name':['joe','anne','black'],
    'age':[18,19,20],
    'sex':['m','f','m'],
    'class':1
}
df04=DataFrame(dic)
df04

    name  age sex  class
0    joe   18   m      1
1   anne   19   f      1
2  black   20   m      1

# DataFrame: 通过字典的方式创建

In [30]:
'''
    通过字典创建dataframe时，字典的key就是列索引
    要求字典的value必须是长度相等的序列，或者是1个标量
'''
dic={
    '语文':[70,80,90],
    '数学':[80,88,90],
    '英语':[80,78,88]
}
df02=DataFrame(dic)
df02

   语文  数学  英语
0  70  80  80
1  80  88  78
2  90  90  88

In [31]:
# 重置行索引
df02.index=['one','two','three']
df02

       语文  数学  英语
one    70  80  80
two    80  88  78
three  90  90  88

In [32]:
# 将自定义索引还原
print(df02.index)
df02.reset_index(drop=True)

Index(['one', 'two', 'three'], dtype='object')

   语文  数学  英语
0  70  80  80
1  80  88  78
2  90  90  88

In [33]:
# 重置行索引
print(df02.columns)
df02.columns=list('abc')
df02

Index(['语文', '数学', '英语'], dtype='object')

        a   b   c
one    70  80  80
two    80  88  78
three  90  90  88

In [34]:
'''
    字典中的value只能是一维数组或者单个的简单数据类型；
    如果是数组，要求所有数组的长度一致
'''
data={
    'apart':['101','102','103','101'],
    'profits':[587.1,125.2,12.2,23.5],
    'year':[2001,2005,2010,2015],
    'month':8
}
df=DataFrame(data)
df

  apart  profits  year  month
0   101    587.1  2001      8
1   102    125.2  2005      8
2   103     12.2  2010      8
3   101     23.5  2015      8

In [35]:
print('行索引',df.index)
print('列索引',df.columns)
print('数据',df.values)

行索引 RangeIndex(start=0, stop=4, step=1)
列索引 Index(['apart', 'profits', 'year', 'month'], dtype='object')
数据 [['101' 587.1 2001 8]
 ['102' 125.2 2005 8]
 ['103' 12.2 2010 8]
 ['101' 23.5 2015 8]]

In [36]:
# 重置行索引
df.index=['one','two','three','four']
df

      apart  profits  year  month
one     101    587.1  2001      8
two     102    125.2  2005      8
three   103     12.2  2010      8
four    101     23.5  2015      8

# DataFrame: 通过Series创建

In [43]:
'''
    zip()函数用于将可迭代对象作为参数，
    将对象中的元素打包成一个个元组，然后返回由这些元组组成的列表。
'''
a=[1,2,3]
b=[4,5,6]
c=[4,5,6,7,8]
zipped=zip(a,b)
for i in zipped:   # 打包为元组的列表
    print(i)

(1, 4)
(2, 5)
(3, 6)

In [40]:
for j in zip(a,c):  # 元素个数与最短的列表一致
    print(j)

(1, 4)
(2, 5)
(3, 6)

In [45]:
zipped=zip(a,b)
for k in zip(*zipped):    # 与zip相反，*zipped可理解为解压，返回二维矩阵
    print(k)

(1, 2, 3)
(4, 5, 6)

In [46]:
ser1=Series(np.array([1,2,3,5]))
ser2=Series(np.array([11,12,13,15]))
ser3=Series(np.array([21,22,23,25]))
xyz=list(zip(ser1,ser2,ser3))
xyz

[(1, 11, 21), (2, 12, 22), (3, 13, 23), (5, 15, 25)]

In [48]:
df1=DataFrame(xyz)
df1

   0   1   2
0  1  11  21
1  2  12  22
2  3  13  23
3  5  15  25

In [51]:
u=zip(*xyz)
print(list(u))
df2=DataFrame(list(zip(*xyz)))
df2

[(1, 2, 3, 5), (11, 12, 13, 15), (21, 22, 23, 25)]

    0   1   2   3
0   1   2   3   5
1  11  12  13  15
2  21  22  23  25

In [52]:
df3=DataFrame([ser1,ser2,ser3])
df3

    0   1   2   3
0   1   2   3   5
1  11  12  13  15
2  21  22  23  25

# DataFrame: set_index()

In [8]:
df=DataFrame(np.random.randint(1,9,(3,4)))
df

   0  1  2  3
0  4  4  8  2
1  3  4  4  7
2  1  7  2  8

In [9]:
df1=df.set_index(3)
df1

   0  1  2
3
2  4  4  8
7  3  4  4
8  1  7  2

In [10]:
df2=df.set_index([1,3])
df2

     0  2
1 3
4 2  4  8
  7  3  4
7 8  1  2

# DataFrame: reset_index()  还原索引

In [11]:
df1=df.set_index(3)
df1

   0  1  2
3
2  4  4  8
7  3  4  4
8  1  7  2

In [13]:
df2=df1.reset_index(drop=True)
df2

   0  1  2
0  4  4  8
1  3  4  4
2  1  7  2

In [14]:
dic={
    'name':['joe','anne','black'],
    'age':[18,19,20],
    'sex':['m','f','m'],
    'class':1
}
df=DataFrame(dic)
df

    name  age sex  class
0    joe   18   m      1
1   anne   19   f      1
2  black   20   m      1

In [15]:
df.index=['a','b','c']
df

    name  age sex  class
a    joe   18   m      1
b   anne   19   f      1
c  black   20   m      1

In [16]:
df1=df.reset_index()
df1

  index   name  age sex  class
0     a    joe   18   m      1
1     b   anne   19   f      1
2     c  black   20   m      1

In [17]:
df2=df.reset_index(drop=True)
df2

    name  age sex  class
0    joe   18   m      1
1   anne   19   f      1
2  black   20   m      1

# DataFrame数据获取

In [37]:
data={
    'apart':['101','102','103','101'],
    'profits':[587.1,125.2,12.2,23.5],
    'year':[2001,2005,2010,2015],
    'month':8
}
df=DataFrame(data)
df

      apart  profits  year  month
one     101    587.1  2001      8
two     102    125.2  2005      8
three   103     12.2  2010      8
four    101     23.5  2015      8

In [38]:
df['year']    # 获取列数据

one      2001
two      2005
three    2010
four     2015
Name: year, dtype: int64

In [40]:
df.loc['one']      # 获取行数据

apart        101
profits    587.1
year        2001
month          8
Name: one, dtype: object

In [41]:
df['month']=[5,6,7,8]   # 修改值
df['pdn']=np.NaN        # 新增列
df.loc['five']=np.NaN   # 新增行
df

      apart  profits    year  month  pdn
one     101    587.1  2001.0    5.0  NaN
two     102    125.2  2005.0    6.0  NaN
three   103     12.2  2010.0    7.0  NaN
four    101     23.5  2015.0    8.0  NaN
five    NaN      NaN     NaN    NaN  NaN

In [53]:
df03=DataFrame(np.random.randint(1,9,(3,3)),index=list('ABC'),columns=list('abc'))
df03

   a  b  c
A  3  4  6
B  2  2  7
C  3  4  2

In [54]:
# 列选择
print(df03['a'])
print(df03[['a','b']])

A    3
B    2
C    3
Name: a, dtype: int32
   a  b
A  3  4
B  2  2
C  3  4

In [55]:
# 列添加
df03['d']=[10,11,12]
df03

   a  b  c   d
A  3  4  6  10
B  2  2  7  11
C  3  4  2  12

In [56]:
# 列修改
df03['d']=[1,2,3]
df03

   a  b  c  d
A  3  4  6  1
B  2  2  7  2
C  3  4  2  3

In [57]:
# 列删除
print(df03.pop('d'))    # pop()返回的是被删除的那一列

A    1
B    2
C    3
Name: d, dtype: int64

In [51]:
del(df03['c'])        # del()返回删除后剩余的部分
df03

   a  b
A  4  4
B  5  5
C  8  4

In [61]:
# 行选择
print(df03.loc['A'])
df03.loc['A':'B']   # 选择多行

a    3
b    4
c    6
Name: A, dtype: int32

   a  b  c
A  3  4  6
B  2  2  7

In [67]:
# 选择某行某列
print(df03.loc['A','c'])
print(df03.loc['A':'B','b'])
print(df03.loc['A':'B','b':'c'])
df03.loc[:,'b':'c']

6
A    4
B    2
Name: b, dtype: int32
   b  c
A  4  6
B  2  7

   b  c
A  4  6
B  2  7
C  4  2

In [68]:
# 通过数字下标选择
print(df03.iloc[1])
df03.iloc[1:3,1:3]

a    2
b    2
c    7
Name: B, dtype: int32

   b  c
B  2  7
C  4  2

In [69]:
# 行切片
print(df03.iloc[1:3])
df03.loc['A':'B']

   a  b  c
B  2  2  7
C  3  4  2

   a  b  c
A  3  4  6
B  2  2  7

In [70]:
# 行添加
df03.loc['D']=[1,2,3]   # loc直接添加
df03

   a  b  c
A  3  4  6
B  2  2  7
C  3  4  2
D  1  2  3

In [71]:
data=DataFrame([[22,33,44]],index=list('F'),columns=['a','b','c'])
df03=df03.append(data)   # append方法
df03

    a   b   c
A   3   4   6
B   2   2   7
C   3   4   2
D   1   2   3
F  22  33  44

In [72]:
# 行修改
df03.loc['A':'C']=[10,100,100]
df03.loc['A']=[1,1,1]
df03

    a    b    c
A   1    1    1
B  10  100  100
C  10  100  100
D   1    2    3
F  22   33   44

In [73]:
# 行删除
df03=df03.drop('F')
df03

    a    b    c
A   1    1    1
B  10  100  100
C  10  100  100
D   1    2    3

# pandas：数据文件读取

In [75]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, skipfooter=0, doublequote=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read CSV (comma-separated) file into DataFrame

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the `online docs for IO Tools
    <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, pathlib.Path, py._path.local.LocalPath or any \
    object with a read() method (such as a file handle or StringIO)
        The string could be a URL. Valid URL schemes include http, ftp, s3, and
        file. For file URLs, a host is expected. For instance, a local file could
        be file://localhost/path/to/table.csv
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``
    delimiter : str, default ``None``
        Alternative argument name for sep.
    delim_whitespace : boolean, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'\t'``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    header : int or list of ints, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so header=0 denotes the first line of
        data rather than the first line of the file.
    names : array-like, default None
        List of column names to use. If file contains no header row, then you
        should explicitly pass header=None. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int or sequence or False, default None
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider index_col=False to force pandas to _not_
        use the first column as the index (row names)
    usecols : list-like or callable, default None
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be [0, 1, 2] or ['foo', 'bar', 'baz']. Element
        order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : boolean, default False
        If the parsed data only contains one column then return a Series
    prefix : str, default None
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : boolean, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels
    true_values : list, default None
        Values to consider as True
    false_values : list, default None
        Values to consider as False
    skipinitialspace : boolean, default False
        Skip spaces after delimiter.
    skiprows : list-like or integer or callable, default None
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c')
    nrows : int, default None
        Number of rows of file to read. Useful for reading pieces of large files
    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : boolean, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file
    verbose : boolean, default False
        Indicate number of NA values placed in non-numeric columns
    skip_blank_lines : boolean, default True
        If True, skip over blank lines rather than interpreting as NaN values
    parse_dates : boolean or list of ints or names or list of lists or dict, default False

        * boolean. If True -> try parsing the index.
        * list of ints or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call result
          'foo'

        If a column or index contains an unparseable date, the entire column or
        index will be returned unaltered as an object data type. For non-standard
        datetime parsing, use ``pd.to_datetime`` after ``pd.read_csv``

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : boolean, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : boolean, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, default None
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : boolean, default False
        DD/MM format dates, international and European format
    iterator : boolean, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, default None
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, default None
        Thousands separator
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    float_precision : string, default None
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.
    lineterminator : str (length 1), default None
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : boolean, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), default None
        One-character string used to escape delimiter when quoting is QUOTE_NONE.
    comment : str, default None
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, default None
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_
    dialect : str or csv.Dialect instance, default None
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : boolean, default False
        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns)
    error_bad_lines : boolean, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : boolean, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    low_memory : boolean, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser)
    memory_map : boolean, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.

    Returns
    -------
    result : DataFrame or TextParser

In [76]:
# 读取csv文件
df01=pd.read_csv('names.csv')
df01

             Casey    176544.3281
0            Riley  154860.665200
1           Jessie  136381.830700
2           Jackie  132928.788700
3            Avery  121797.419500
4            Jaime  109870.187300
5           Peyton   94896.395220
6            Kerry   88963.926250
7             Jody   80400.519200
8          Kendall   79210.873960
9           Payton   64151.630390
10          Skyler   53486.390420
11         Frankie   51288.068110
12             Pat   44781.602370
13           Quinn   41920.940060
14          Harley   41237.565740
15           Reese   36360.520610
16          Robbie   32636.047650
17          Tommie   29528.793820
18         Justice   27350.564570
19            Kris   24955.811340
20           Carey   24790.097050
21         Emerson   24167.154360
22           Blair   23160.101100
23           Amari   22296.161370
24          Elisha   22184.559370
25            Sage   21336.062280
26           Emery   18844.118880
27          Stevie   18665.219120
28           Rowan   18367.420460
29           Ollie   17889.750340
..             ...            ...
888          Ronne     111.657837
889          Sehaj     111.285543
890          Tagan     111.076315
891         Luvern     110.746093
892           Lyan     110.250095
893         Peniel     110.216069
894           Ryin     110.061346
895         Skylur     108.968124
896        Skylier     108.758081
897  Oluwadarasimi     108.353861
898          Psalm     108.230882
899         Aidynn     107.344514
900        Juliani     107.272545
901         Johany     107.173152
902          Rainn     106.336104
903          Liron     106.120731
904           Vail     106.056996
905         Gillie     105.527474
906         Armari     104.214954
907          Kache     104.096492
908         Eudell     103.921273
909         Mikele     103.518292
910          Alija     103.229976
911          Carel     102.758657
912       Olayinka     102.625879
913          Eaden     102.319579
914       Inioluwa     101.384201
915           Gwin     101.243364
916         Yacine     100.230400
917           Aeon     100.211040

[918 rows x 2 columns]

In [79]:
# 读取文本数据
df02=pd.read_csv('test.txt',sep=';',header=None)   # 指定分隔符为“；”，不读取头部数据
df02

          0       1
0     hello  python
1  tangyudi     123
2        ML     456
3        DL     789
4      data     234

# pandas：数据文件存储

In [80]:
df01.to_csv('data.csv')

In [81]:
df02.to_csv('txt.txt',sep=';',header=None)    # header=None 将列表转化为数据

In [19]:
res1=pd.read_excel('account.xlsx',header=None,names=['a','b','c'])
res1

                          a   b     c
0  5bd6fc3c4978b5577dc4fb09  上海    张三
1  5bd6fc714978b5577dc4fb0a  南京    李四
2  5bd6fcb24978b5577dc4fb0b  合肥  王二麻子

# pandas：数据过滤获取

In [138]:
'''
    通过DataFrame的相关方式可以获取对应的列或者数据形成一个新的DataFrame,
    方便后续进行统计计算。
'''
datas={
    'a':['aaa','bbb','ccc'],
    'b':[70,80,90],
    'c':[70,80,90],
    'd':[80,88,90],
    'e':[80,78,88]
}
df=DataFrame(datas)
df.index.name='ID'
df

      a   b   c   d   e
ID
0   aaa  70  70  80  80
1   bbb  80  80  88  78
2   ccc  90  90  90  88

In [139]:
columns=['name','age','语文','数学','英语']
df.columns=columns
df

   name  age  语文  数学  英语
ID
0   aaa   70  70  80  80
1   bbb   80  80  88  78
2   ccc   90  90  90  88

In [140]:
df.loc[:,'数学':'语文']

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [141]:
df.iloc[1,2]=np.NaN
df[['数学','语文','英语']]   # 只获取成绩的列，生成新的dataframe

    数学    语文  英语
ID
0   80  70.0  80
1   88   NaN  78
2   90  90.0  88

In [142]:
# 删除NaN的行
df=df.dropna()
df

   name  age    语文  数学  英语
ID
0   aaa   70  70.0  80  80
2   ccc   90  90.0  90  88

In [143]:
df=df[columns[2:]]
df

      语文  数学  英语
ID
0   70.0  80  80
2   90.0  90  88

In [144]:
df.describe()

              语文         数学         英语
count   2.000000   2.000000   2.000000
mean   80.000000  85.000000  84.000000
std    14.142136   7.071068   5.656854
min    70.000000  80.000000  80.000000
25%    75.000000  82.500000  82.000000
50%    80.000000  85.000000  84.000000
75%    85.000000  87.500000  86.000000
max    90.000000  90.000000  88.000000

In [22]:
df00=DataFrame(np.random.randint(1,9,(4,4)),index=list('abcd'),columns=list('ABCD'))
print(df00)
print(df00.columns[2:])
print(df00[['A','C']])
print(df00.loc[:,'A':'C'])

   A  B  C  D
a  6  4  7  6
b  7  1  1  4
c  4  4  1  3
d  7  7  7  1
Index(['C', 'D'], dtype='object')
   A  C
a  6  7
b  7  1
c  4  1
d  7  7
   A  B  C
a  6  4  7
b  7  1  1
c  4  4  1
d  7  7  7

# pandas：缺省值NaN处理方法

In [26]:
df1=DataFrame(np.random.randint(1,9,(4,5)),index=list('abcd'),columns=list('ABCDE'))
df1

   A  B  C  D  E
a  1  7  3  3  6
b  6  7  5  1  3
c  5  2  8  8  4
d  3  5  1  1  2

In [27]:
# 修改dataframe中的值
df1.loc['b','C']=np.nan
df1.loc['c','D']=np.nan
df1        # 针对dataframe  通过loc   设置行列对应的值=。。。

   A  B    C    D  E
a  1  7  3.0  3.0  6
b  6  7  NaN  1.0  3
c  5  2  8.0  NaN  4
d  3  5  1.0  1.0  2

In [108]:
df2=DataFrame([
    ['Tom',np.nan,456.67,'M'],
    ['Merry',34,345.56,np.nan],
    ['Gerry',np.nan,np.nan,np.nan],
    ['John',23,np.nan,'M'],
    ['Joe',18,385.12,'F']
],columns=['name','age','salary','gender'])
df2

    name   age  salary gender
0    Tom   NaN  456.67      M
1  Merry  34.0  345.56    NaN
2  Gerry   NaN     NaN    NaN
3   John  23.0     NaN      M
4    Joe  18.0  385.12      F

In [110]:
df2.isnull()

    name    age  salary  gender
0  False   True   False   False
1  False  False   False    True
2  False   True    True    True
3  False  False    True   False
4  False  False   False   False

In [111]:
df2.notnull()

   name    age  salary  gender
0  True  False    True    True
1  True   True    True   False
2  True  False   False   False
3  True   True   False    True
4  True   True    True    True

In [113]:
df2.dropna()    # 默认丢弃只要包含缺失值的行

  name   age  salary gender
4  Joe  18.0  385.12      F

In [114]:
df2.dropna(how='all')    # 定义为只丢弃所有数据都是缺失值的行

    name   age  salary gender
0    Tom   NaN  456.67      M
1  Merry  34.0  345.56    NaN
2  Gerry   NaN     NaN    NaN
3   John  23.0     NaN      M
4    Joe  18.0  385.12      F

In [115]:
# 丢弃列
df2.dropna(axis=1)

    name
0    Tom
1  Merry
2  Gerry
3   John
4    Joe

In [116]:
datas={
    'name':['aaa','bbb','ccc'],
    'age':[70,80,90],
    '语文':[70,80,88],
    '数学':[82,78,80],
    '英语':[86,88,90]
}
df=DataFrame(datas)
df.index.name='ID'
df

   name  age  语文  数学  英语
ID
0   aaa   70  70  82  86
1   bbb   80  80  78  88
2   ccc   90  88  80  90

In [117]:
df.loc[2,'英语']=np.nan
df.loc[1,'name']=np.nan
df.loc[3]=np.nan
df['address']=np.nan
df

   name   age    语文    数学    英语  address
ID
0   aaa  70.0  70.0  82.0  86.0      NaN
1   NaN  80.0  80.0  78.0  88.0      NaN
2   ccc  90.0  88.0  80.0   NaN      NaN
3   NaN   NaN   NaN   NaN   NaN      NaN

In [119]:
# dropna
df2=df.dropna() # 默认删除只要包含NAN的行
df2

Empty DataFrame
Columns: [name, age, 语文, 数学, 英语, address]
Index: []

In [120]:
df2=df.dropna(axis=1) # 删除只要包含NAN的行
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [121]:
df2=df.dropna(how='all',axis=1) # 删除所有元素为NAN的列
df2

   name   age    语文    数学    英语
ID
0   aaa  70.0  70.0  82.0  86.0
1   NaN  80.0  80.0  78.0  88.0
2   ccc  90.0  88.0  80.0   NaN
3   NaN   NaN   NaN   NaN   NaN

In [23]:
df01=DataFrame(np.random.randint(1,10,(4,4)))
df01.loc[1:2,1]=np.NaN
df01.loc[1:2,3]=np.NaN
df01

   0    1    2    3
0  6  5.0  6.0  4.0
1  7  NaN  4.0  NaN
2  9  NaN  NaN  NaN
3  8  3.0  3.0  7.0

In [129]:
# 给所有缺失值用0填充
df01.fillna(0)

   0    1  2    3
0  9  3.0  3  8.0
1  5  0.0  3  0.0
2  7  0.0  2  0.0
3  6  2.0  6  3.0

In [130]:
# 向前填充
df01.fillna(method='ffill')

   0    1  2    3
0  9  3.0  3  8.0
1  5  3.0  3  8.0
2  7  3.0  2  8.0
3  6  2.0  6  3.0

In [131]:
# 向后填充
df01.fillna(method='bfill')

   0    1  2    3
0  9  3.0  3  8.0
1  5  2.0  3  3.0
2  7  2.0  2  3.0
3  6  2.0  6  3.0

In [132]:
# 指定填充
df01.fillna({1:50,3:100})

   0     1  2      3
0  9   3.0  3    8.0
1  5  50.0  3  100.0
2  7  50.0  2  100.0
3  6   2.0  6    3.0

In [133]:
# 指定值替换
df01.replace({np.NaN:100,1:200})

   0      1  2      3
0  9    3.0  3    8.0
1  5  100.0  3  100.0
2  7  100.0  2  100.0
3  6    2.0  6    3.0

In [134]:
df02=DataFrame(np.random.randint(1,5,(5,3)))
df02.loc[1:3,1]=np.NaN
df02.loc[2,2]=np.NaN
df02

   0    1    2
0  1  1.0  1.0
1  4  NaN  3.0
2  2  NaN  NaN
3  3  NaN  1.0
4  1  2.0  3.0

In [137]:
# fillna
df02.fillna(0)
df02.fillna(method='ffill')   # 向前填充
df02.fillna(method='bfill')   # 向后填充
df02.fillna({1:100,2:0})      # 替换填充
df02.replace({np.nan:'haha'})   # 替换

   0     1     2
0  1     1     1
1  4  haha     3
2  2  haha  haha
3  3  haha     1
4  1     2     3

In [122]:
df03=DataFrame(np.random.randn(7,3))
df03.loc[:4,1]=np.nan
df03.loc[:2,2]=np.nan
df03

          0         1         2
0  0.040788       NaN       NaN
1 -0.828892       NaN       NaN
2 -0.593729       NaN       NaN
3 -0.793041       NaN  2.132666
4  0.159505       NaN -0.282930
5  0.225354 -0.643045 -0.411295
6  0.314350  0.148915 -0.452124

In [123]:
df03.fillna(0)

          0         1         2
0  0.040788  0.000000  0.000000
1 -0.828892  0.000000  0.000000
2 -0.593729  0.000000  0.000000
3 -0.793041  0.000000  2.132666
4  0.159505  0.000000 -0.282930
5  0.225354 -0.643045 -0.411295
6  0.314350  0.148915 -0.452124

In [126]:
df03.fillna({1:0.5,2:-1,3:1})

          0         1         2
0  0.040788  0.500000 -1.000000
1 -0.828892  0.500000 -1.000000
2 -0.593729  0.500000 -1.000000
3 -0.793041  0.500000  2.132666
4  0.159505  0.500000 -0.282930
5  0.225354 -0.643045 -0.411295
6  0.314350  0.148915 -0.452124

# pandas：常用的数学统计方法

In [2]:
frame=DataFrame(np.arange(8).reshape(2,-1),index=['three','one'],columns=list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [3]:
# 对于dataframe，这些统计方法默认是计算各列上的数据
frame.count()

d    2
a    2
b    2
c    2
dtype: int64

In [4]:
# 如果要应用于各行数据，则增加参数axis=1
frame.count(axis=1)

three    4
one      4
dtype: int64

In [51]:
score=pd.read_csv('txt.txt',sep=';',header=None)
score

       0   1   2   3
0    one  70  80  80
1    two  80  88  78
2  three  90  90  88

In [52]:
index=list('abc')
columns=['part','A','B','C']
score.index=index
score.columns=columns
score

    part   A   B   C
a    one  70  80  80
b    two  80  88  78
c  three  90  90  88

In [53]:
score=score.set_index('part')
score

        A   B   C
part
one    70  80  80
two    80  88  78
three  90  90  88

In [54]:
score.describe()

          A          B          C
count   3.0   3.000000   3.000000
mean   80.0  86.000000  82.000000
std    10.0   5.291503   5.291503
min    70.0  80.000000  78.000000
25%    75.0  84.000000  79.000000
50%    80.0  88.000000  80.000000
75%    85.0  89.000000  84.000000
max    90.0  90.000000  88.000000

In [55]:
# 返回数量
score.count()

A    3
B    3
C    3
dtype: int64

In [56]:
# 返回最大值
score.max()
score.max(axis=1)

part
one      80
two      88
three    90
dtype: int64

In [57]:
# 返回最小值
score.min()
score.min(axis=1)

part
one      70
two      78
three    88
dtype: int64

In [59]:
#返回最大值ID
score.idxmax()
score.idxmax(axis=1)

part
one      B
two      B
three    A
dtype: object

# pandas：相关系数与协方差

In [28]:
'''
    协方差的结果为正代表同向运动，否则则是反向运动
'''
df=DataFrame({
    'dw':[1,2,3,4,5,6],
    'kill':[10,3,5,8,2,1]
})
df

   dw  kill
0   1    10
1   2     3
2   3     5
3   4     8
4   5     2
5   6     1

In [29]:
df['dw'].cov(df['kill'])

-4.5

In [60]:
df1=DataFrame({
    'GDP':[12,23,34,45,56],
    'air_temperature':[23,25,26,27,30],
    'year':['2001','2002','2003','2004','2005']
})
df1

   GDP  air_temperature  year
0   12               23  2001
1   23               25  2002
2   34               26  2003
3   45               27  2004
4   56               30  2005

In [61]:
print('相关系数',df1.corr())
print('协方差',df1.cov())
print(df1['GDP'].corr(df1['air_temperature']))
print(df1['GDP'].cov(df1['air_temperature']))

相关系数                       GDP  air_temperature
GDP              1.000000         0.977356
air_temperature  0.977356         1.000000
协方差                    GDP  air_temperature
GDP              302.5             44.0
air_temperature   44.0              6.7
0.9773555548504418
44.0

In [62]:
df2=DataFrame({
    'GDP':[900,1000,1100,1200,1300],
    'foreign_Trade':[600,550,500,400,300],
    'year':['2012','2013','2014','2015','2016']
})
df2

    GDP  foreign_Trade  year
0   900            600  2012
1  1000            550  2013
2  1100            500  2014
3  1200            400  2015
4  1300            300  2016

In [63]:
df2['GDP'].cov(df2['foreign_Trade'])

-18750.0

In [64]:
df2['GDP'].corr(df2['foreign_Trade'])

-0.9847982464479191

# pandas：唯一值,值计数以及成员资格

In [76]:
ser01=Series(np.random.randint(1,5,9))
print(ser01)
ser01.value_counts()     # 计算每个元素出现的次数

0    4
1    1
2    2
3    2
4    2
5    4
6    1
7    2
8    2
dtype: int32

2    5
4    2
1    2
dtype: int64

In [65]:
ser=Series(['a','b','c','a','a','c','b'])
print(ser)
print()
print(ser.unique())    # 去重后的值

0    a
1    b
2    c
3    a
4    a
5    c
6    b
dtype: object

['a' 'b' 'c']

In [72]:
print(ser.value_counts())  # 默认会按值出现的频率降序排列
print(ser.value_counts(ascending=True))

a    3
c    2
b    2
dtype: int64
b    2
c    2
a    3
dtype: int64

In [73]:
# isin
mask=ser.isin(['b','c'])
mask

0    False
1     True
2     True
3    False
4    False
5     True
6     True
dtype: bool

In [74]:
ser[mask]    # 选出值为‘b’、‘c’的项

1    b
2    c
5    c
6    b
dtype: object

In [78]:
mask=~ser.isin(['b','c'])
mask

0     True
1    False
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [79]:
ser[mask]   # 值不是‘b’、‘c’的项

0    a
3    a
4    a
dtype: object

In [68]:
df=DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90]
})
df

  order_id member_id  order_amt
0     1001       a01         80
1     1002       a02         90
2     1003       a03         70
3     1004       a01         79
4     1005       a02         88
5     1006       a03         90

In [69]:
print('下单用户：')
df['member_id'].unique()

下单用户：

array(['a01', 'a02', 'a03'], dtype=object)

In [75]:
print('用户下单次数：')
df['member_id'].value_counts()

用户下单次数：

a02    2
a01    2
a03    2
Name: member_id, dtype: int64

# pandas：层次索引

In [31]:
ser=Series([1,2,3,4,5],index=[
    ['2015','2015','2015','2016','2016'],
    ['a','b','c','a','b']
])
ser

2015  a    1
      b    2
      c    3
2016  a    4
      b    5
dtype: int64

In [33]:
# 通过索引获取数据
print(ser['2015','a'])
print(ser['2015']['a'])

1
1

In [34]:
# 切片
ser[:'a']      # 无法直接获取a的值

2015  a    1
      b    2
      c    3
2016  a    4
      b    5
dtype: int64

In [35]:
# 交换分层索引
ser.swaplevel()

a  2015    1
b  2015    2
c  2015    3
a  2016    4
b  2016    5
dtype: int64

In [50]:
df22=ser.unstack()
df22

        a    b    c
2015  1.0  2.0  3.0
2016  4.0  5.0  NaN

In [51]:
ser33=df22.stack()
ser33

2015  a    1.0
      b    2.0
      c    3.0
2016  a    4.0
      b    5.0
dtype: float64

In [80]:
# 将数据和索引之间的转化
data=Series([100,200,122,150,180],
            index=[
                ['2016','2016','2016','2017','2017'],
                ['苹果','香蕉','西瓜','苹果','西瓜']
            ])
data

2016  苹果    100
      香蕉    200
      西瓜    122
2017  苹果    150
      西瓜    180
dtype: int64

In [81]:
data['2016']

苹果    100
香蕉    200
西瓜    122
dtype: int64

In [82]:
data[:,'苹果']

2016    100
2017    150
dtype: int64

In [83]:
# 交换分层索引swaplevel()
data01=data.swaplevel().sort_index()
data01

苹果  2016    100
    2017    150
西瓜  2016    122
    2017    180
香蕉  2016    200
dtype: int64

In [84]:
# 转变为dataframe索引的堆
data02=data.unstack(level=1)    # level等于哪一列，哪一列就转换成索引
data02

         苹果     西瓜     香蕉
2016  100.0  122.0  200.0
2017  150.0  180.0    NaN

In [85]:
data02=data.unstack(level=0)    
data02

     2016   2017
苹果  100.0  150.0
西瓜  122.0  180.0
香蕉  200.0    NaN

In [84]:
# DataFrame的分层索引
df = DataFrame({
    'year':[2011,2012,2011,2013,2010,2012,2014],
    'fruit':['apple','apple','banana','orange','orange','leon','leon'],
    'name':['jack1','jack2','jack3','jack4','jack5','jack6','jack7'],
    'score':[211,12,11,20,13,201,14],
    'profits':[111,222,333,444,555,666,777]
})
df

   year   fruit   name  score  profits
0  2011   apple  jack1    211      111
1  2012   apple  jack2     12      222
2  2011  banana  jack3     11      333
3  2013  orange  jack4     20      444
4  2010  orange  jack5     13      555
5  2012    leon  jack6    201      666
6  2014    leon  jack7     14      777

In [85]:
# 设置分层索引
df02=df.set_index(['year','fruit'])
df02

              name  score  profits
year fruit
2011 apple   jack1    211      111
2012 apple   jack2     12      222
2011 banana  jack3     11      333
2013 orange  jack4     20      444
2010 orange  jack5     13      555
2012 leon    jack6    201      666
2014 leon    jack7     14      777

In [86]:
# 交换分层索引
df03=df02.swaplevel().sort_index()
df03

              name  score  profits
fruit  year
apple  2011  jack1    211      111
       2012  jack2     12      222
banana 2011  jack3     11      333
leon   2012  jack6    201      666
       2014  jack7     14      777
orange 2010  jack5     13      555
       2013  jack4     20      444

In [87]:
# 根据索引获取值
df03.loc['apple','profits']

year
2011    111
2012    222
Name: profits, dtype: int64

In [88]:
df03.loc['apple','name':'score']

       name  score
year
2011  jack1    211
2012  jack2     12

In [89]:
df02.loc[:,'profits']  # 获取列数据

year  fruit
2011  apple     111
2012  apple     222
2011  banana    333
2013  orange    444
2010  orange    555
2012  leon      666
2014  leon      777
Name: profits, dtype: int64

In [99]:
# 未堆栈
df04=df03.unstack()
print(df04)
df04.loc[:,'profits'][2012]

         name                             score                            \
year     2010   2011   2012   2013   2014  2010   2011   2012  2013  2014
fruit
apple     NaN  jack1  jack2    NaN    NaN   NaN  211.0   12.0   NaN   NaN
banana    NaN  jack3    NaN    NaN    NaN   NaN   11.0    NaN   NaN   NaN
leon      NaN    NaN  jack6    NaN  jack7   NaN    NaN  201.0   NaN  14.0
orange  jack5    NaN    NaN  jack4    NaN  13.0    NaN    NaN  20.0   NaN

       profits
year      2010   2011   2012   2013   2014
fruit
apple      NaN  111.0  222.0    NaN    NaN
banana     NaN  333.0    NaN    NaN    NaN
leon       NaN    NaN  666.0    NaN  777.0
orange   555.0    NaN    NaN  444.0    NaN

fruit
apple     222.0
banana      NaN
leon      666.0
orange      NaN
Name: 2012, dtype: float64

In [100]:
# 堆叠
df04.stack(level=0)

year             2010   2011   2012   2013   2014
fruit
apple  name       NaN  jack1  jack2    NaN    NaN
       profits    NaN    211     12    NaN    NaN
       score      NaN    111    222    NaN    NaN
banana name       NaN  jack3    NaN    NaN    NaN
       profits    NaN     11    NaN    NaN    NaN
       score      NaN    333    NaN    NaN    NaN
leon   name       NaN    NaN  jack6    NaN  jack7
       profits    NaN    NaN    201    NaN     14
       score      NaN    NaN    666    NaN    777
orange name     jack5    NaN    NaN  jack4    NaN
       profits     13    NaN    NaN     20    NaN
       score      555    NaN    NaN    444    NaN

# pandas：按照层次索引进行统计数据

In [38]:
df02=df.set_index(['year','fruit'])
df02

              name  score  profits
year fruit
2011 apple   jack1    211      111
2012 apple   jack2     12      222
2011 banana  jack3     11      333
2013 orange  jack4     20      444
     orange  jack5     13      555
2012 leon    jack6    201      666
2014 leon    jack7     14      777

In [101]:
# 根据行索引统计
df02.sum(level='fruit')

        score  profits
fruit
apple     223      333
banana     11      333
orange     33      999
leon      215     1443

In [102]:
df02.mean(level='year')

      score  profits
year
2011  111.0    222.0
2012  106.5    444.0
2013   20.0    444.0
2010   13.0    555.0
2014   14.0    777.0

In [103]:
df02.min(level=['year','fruit'])

              name  score  profits
year fruit
2011 apple   jack1    211      111
2012 apple   jack2     12      222
2011 banana  jack3     11      333
2013 orange  jack4     20      444
2010 orange  jack5     13      555
2012 leon    jack6    201      666
2014 leon    jack7     14      777

In [104]:
df02['profits'].mean(level='year')

year
2011    222
2012    444
2013    444
2010    555
2014    777
Name: profits, dtype: int64

In [107]:
ser2=Series([1,2,3,4,5],index=[
    ['2015','2015','2015','2016','2016'],
    ['a','b','c','a','b'],
    ['aa','aa','cc','cc','aa']
])
ser2

2015  a  aa    1
      b  aa    2
      c  cc    3
2016  a  cc    4
      b  aa    5
dtype: int64

In [108]:
# level=   对应索引层次
diff=ser2.unstack(level=2) 
diff

         aa   cc
2015 a  1.0  NaN
     b  2.0  NaN
     c  NaN  3.0
2016 a  NaN  4.0
     b  5.0  NaN

# Pandas：排序之sort_index

In [102]:
ser1=Series(np.arange(0,4),index=['b','c','d','a'])
ser1

b    0
c    1
d    2
a    3
dtype: int32

In [103]:
# 通过索引进行排序
ser1.sort_index()

a    3
b    0
c    1
d    2
dtype: int32

In [104]:
ser1.sort_index(ascending=False)     # 倒序，index由大到小

d    2
c    1
b    0
a    3
dtype: int32

In [105]:
df1=DataFrame(np.random.randint(1,9,(4,4)),
             columns=['b','c','a','d'],
             index=['B','D','A','C'])
df1

   b  c  a  d
B  5  4  7  6
D  8  2  2  3
A  3  5  4  3
C  5  2  2  3

In [106]:
# 通过行索引排序（默认按行索引排序）
df1.sort_index()

   b  c  a  d
A  3  5  4  3
B  5  4  7  6
C  5  2  2  3
D  8  2  2  3

In [107]:
# 通过列索引排序
df1.sort_index(axis=1)

   a  b  c  d
B  7  5  4  6
D  2  8  2  3
A  4  3  5  3
C  2  5  2  3

In [108]:
# 列索引倒序
df1.sort_index(axis=1,ascending=False)

   d  c  b  a
B  6  4  5  7
D  3  2  8  2
A  3  5  3  4
C  3  2  5  2

# Pandas排序之sort_values

In [109]:
'''
    对Series按值进行排序, 排序时，任何缺失值默认都会被放到Series的末尾。
'''
ser1.sort_values()     # 通过值进行排序

b    0
c    1
d    2
a    3
dtype: int32

In [110]:
df1.sort_values(by=['d','b'])   # 通过某列的值进行排序

   b  c  a  d
A  3  5  4  3
C  5  2  2  3
D  8  2  2  3
B  5  4  7  6

In [112]:
df2=df1.sort_index().sort_index(axis=1)
df2

   a  b  c  d
A  4  3  5  3
B  7  5  4  6
C  2  5  2  3
D  2  8  2  3

In [113]:
df2.sort_values(by='B',axis=1)   # 按行索引对B行的值排序

   c  b  d  a
A  5  3  3  4
B  4  5  6  7
C  2  5  3  2
D  2  8  3  2

In [114]:
df2.sort_values(by='C',axis=1,ascending=False)    # 逆序

   b  d  a  c
A  3  3  4  5
B  5  6  7  4
C  5  3  2  2
D  8  3  2  2

In [115]:
df2.sort_values(by=['C','B'],axis=1,ascending=False)

   b  d  a  c
A  3  3  4  5
B  5  6  7  4
C  5  3  2  2
D  8  3  2  2

# Pandas：排序之rank

In [116]:
ser=Series([3,4,1,3,3],index=list('abcde'))
ser

a    3
b    4
c    1
d    3
e    3
dtype: int64

In [117]:
ser.rank()     # 默认method='average'

a    3.0
b    5.0
c    1.0
d    3.0
e    3.0
dtype: float64

In [118]:
ser.rank(method='min')

a    2.0
b    5.0
c    1.0
d    2.0
e    2.0
dtype: float64

In [119]:
ser.rank(method='max')

a    4.0
b    5.0
c    1.0
d    4.0
e    4.0
dtype: float64

In [120]:
ser.rank(method='first')

a    2.0
b    5.0
c    1.0
d    3.0
e    4.0
dtype: float64

In [121]:
df=DataFrame(np.random.randint(0,5,[4,4]))
df

   0  1  2  3
0  3  1  3  3
1  1  0  4  3
2  1  2  0  3
3  3  0  2  0

In [122]:
# 默认按照列排名
df.rank()

     0    1    2    3
0  3.5  3.0  3.0  3.0
1  1.5  1.5  4.0  3.0
2  1.5  4.0  1.0  3.0
3  3.5  1.5  2.0  1.0

In [123]:
# 按照行排名
df.rank(axis=1)

     0    1    2    3
0  3.0  1.0  3.0  3.0
1  2.0  1.0  4.0  3.0
2  2.0  3.0  1.0  4.0
3  4.0  1.5  3.0  1.5

# Pandas之时间序列

In [110]:
'''
    start：string或datetime-like，默认值是None，表示日期的起点。
    end：string或datetime-like，默认值是None，表示日期的终点。
    periods：integer或None，默认值是None，表示你要从这个函数产生多少个日期索引值；如果是None的话，那么start和end必须不能为None。
    freq：string或DateOffset，默认值是’D’，表示以自然日为单位，这个参数用来指定计时单位，比如’5H’表示每隔5个小时计算一次。
    tz：string或None，表示时区，例如：’Asia/Hong_Kong’。
    normalize：bool，默认值为False，如果为True的话，那么在产生时间索引值之前会先把start和end都转化为当日的午夜0点。
    name：str，默认值为None，给返回的时间索引指定一个名字。
    closed：string或者None，默认值为None，表示start和end这个区间端点是否包含在区间内，可以有三个值，’left’表示左闭右开区间，’right’表示左开右闭区间，None表示两边都是闭区间。
'''
# 创建时间序列
pd.date_range(start='20170101',end='20170110',freq='h')

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-01 01:00:00',
               '2017-01-01 02:00:00', '2017-01-01 03:00:00',
               '2017-01-01 04:00:00', '2017-01-01 05:00:00',
               '2017-01-01 06:00:00', '2017-01-01 07:00:00',
               '2017-01-01 08:00:00', '2017-01-01 09:00:00',
               ...
               '2017-01-09 15:00:00', '2017-01-09 16:00:00',
               '2017-01-09 17:00:00', '2017-01-09 18:00:00',
               '2017-01-09 19:00:00', '2017-01-09 20:00:00',
               '2017-01-09 21:00:00', '2017-01-09 22:00:00',
               '2017-01-09 23:00:00', '2017-01-10 00:00:00'],
              dtype='datetime64[ns]', length=217, freq='H')

In [109]:
# 创建10个时间序列
pd.date_range(start='20170101',periods=10,freq='d')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10'],
              dtype='datetime64[ns]', freq='D')

In [130]:
# 创建一个时间序列，步长三天
pd.date_range(start='20170101',periods=10,freq='3D')

DatetimeIndex(['2017-01-01', '2017-01-04', '2017-01-07', '2017-01-10',
               '2017-01-13', '2017-01-16', '2017-01-19', '2017-01-22',
               '2017-01-25', '2017-01-28'],
              dtype='datetime64[ns]', freq='3D')

In [132]:
# 创建一个时间序列，以分钟为步长
pd.date_range(start='20170101',periods=10,freq='min')

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-01 00:01:00',
               '2017-01-01 00:02:00', '2017-01-01 00:03:00',
               '2017-01-01 00:04:00', '2017-01-01 00:05:00',
               '2017-01-01 00:06:00', '2017-01-01 00:07:00',
               '2017-01-01 00:08:00', '2017-01-01 00:09:00'],
              dtype='datetime64[ns]', freq='T')

In [133]:
# 创建一个时间序列，以秒为步长
pd.date_range(start='20170101',periods=10,freq='s')

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-01 00:00:01',
               '2017-01-01 00:00:02', '2017-01-01 00:00:03',
               '2017-01-01 00:00:04', '2017-01-01 00:00:05',
               '2017-01-01 00:00:06', '2017-01-01 00:00:07',
               '2017-01-01 00:00:08', '2017-01-01 00:00:09'],
              dtype='datetime64[ns]', freq='S')

# Pandas之表合并

In [117]:
# merge
'''
    on=None 用于显示指定列名（键名），如果该列在两个对象上的列名不同，则可以通过 left_on=None, right_on=None 来分别指定。或者想直接使用行索引作为连接键的话，就将 left_index=False, right_index=False 设为 True。
    how='inner' 参数指的是当左右两个对象中存在不重合的键时，取结果的方式：inner 代表交集；outer 代表并集；left 和 right 分别为取一边。
    suffixes=('_x','_y') 指的是当左右对象中存在除连接键外的同名列时，结果集中的区分方式，可以各加一个小尾巴。
    对于多对多连接，结果采用的是行的笛卡尔积。
'''
df1=DataFrame({
    'data1':[1,2,3,4],
    'key1':['a','b','c','d']
})
df2=DataFrame({
    'data2':[9,8,7,6],
    'key1':['a','b','e','f']
})
print(df1)
print(df2)

   data1 key1
0      1    a
1      2    b
2      3    c
3      4    d
   data2 key1
0      9    a
1      8    b
2      7    e
3      6    f

In [112]:
# 默认按照相同的列名,或通过on制定，只要有相同的键 on可以省略。否则合并结果为空
df3=pd.merge(df1,df2,on='key1')
df3

   data1 key1  data2
0      1    a      9
1      2    b      8

In [113]:
# How指定连接方式。如外连接
df4=pd.merge(df1,df2,how='outer',on='key1')
df4

   data1 key1  data2
0    1.0    a    9.0
1    2.0    b    8.0
2    3.0    c    NaN
3    4.0    d    NaN
4    NaN    e    7.0
5    NaN    f    6.0

In [150]:
df5=pd.merge(df1,df2,how='left',on='key1')
df5

   data1 key1  data2
0      1    a    9.0
1      2    b    8.0
2      3    c    NaN
3      4    d    NaN

In [119]:
df5=pd.merge(df1,df2,on='key1',suffixes=('_xx','_yy'))
df5

   data1 key1  data2
0      1    a      9
1      2    b      8

In [152]:
df7=pd.merge(df1,df2,left_index=True,right_index=True)
df7

   data1 key1_x  data2 key1_y
0      1      a      9      a
1      2      b      8      b
2      3      c      7      e
3      4      d      6      f

In [115]:
dic1={ 'data1':[1,2,3,4],'key1':['a','b','b','m']}
df01=DataFrame(dic1)
dic2={ 'data2':[11,22,334,4],'key2':['a','b','b','n']}
df02=DataFrame(dic2)
# 没有相同列名时，分别指定列名进行多对多一一对应,否则合并为空
df03=pd.merge(df01,df02,left_on='key1',right_on='key2')
df03

   data1 key1  data2 key2
0      1    a     11    a
1      2    b     22    b
2      2    b    334    b
3      3    b     22    b
4      3    b    334    b

In [120]:
# concat
'''
    objs: series，dataframe或者是panel构成的序列lsit 
    axis： 需要合并链接的轴，0是行，1是列 
    join：连接的方式 inner，或者outer
'''
df1=DataFrame({
    'key':['a','a','b','b'],
    'data1':range(4)
})
df2=DataFrame({
    'key':['b','b','c','c'],
    'data2':range(4)
})
print(df1)
print(df2)

  key  data1
0   a      0
1   a      1
2   b      2
3   b      3
  key  data2
0   b      0
1   b      1
2   c      2
3   c      3

In [162]:
pd.concat([df1,df2],axis=1)

  key  data1 key  data2
0   a      0   b      0
1   a      1   b      1
2   b      2   c      2
3   b      3   c      3

In [163]:
pd.merge(df1,df2,left_index=True,right_index=True,how='outer')

  key_x  data1 key_y  data2
0     a      0     b      0
1     a      1     b      1
2     b      2     c      2
3     b      3     c      3

In [121]:
# 连接公共列名
pd.concat([df1,df2],axis=0,join='inner',sort=True)

  key
0   a
1   a
2   b
3   b
0   b
1   b
2   c
3   c

# Pandas分组与聚合操作

In [168]:
data=DataFrame({
    'data1':np.random.randint(1,9,5),
    'data2':np.random.randint(1,9,5),
    'key1':list('aabba'),
    'key2':['one','one','two','one','two']
})
data

   data1  data2 key1 key2
0      8      1    a  one
1      2      3    a  one
2      2      2    b  two
3      6      2    b  one
4      6      2    a  two

In [169]:
datas=data.groupby('key1')
datas

In [170]:
for i in datas:
    print(i)

('a',    data1  data2 key1 key2
0      8      1    a  one
1      2      3    a  one
4      6      2    a  two)
('b',    data1  data2 key1 key2
2      2      2    b  two
3      6      2    b  one)

In [171]:
# 通过key1进行分组，分别进行聚合操作
datas.mean()

         data1  data2
key1
a     5.333333    2.0
b     4.000000    2.0

In [172]:
datas.sum()

      data1  data2
key1
a        16      6
b         8      4

In [173]:
datas.min()

      data1  data2 key2
key1
a         2      1  one
b         2      2  one

In [174]:
datas.max()

      data1  data2 key2
key1
a         8      3  two
b         6      2  two

In [175]:
# 随机下标
key=[1,2,2,1,2]
data.groupby(key)['data1'].mean()

1    7.000000
2    3.333333
Name: data1, dtype: float64

In [176]:
# 通过某一列进行分组，分别获取一列或者两列数据
data.groupby('key1')['data1'].sum()

key1
a    16
b     8
Name: data1, dtype: int32

In [177]:
data.groupby('key1')['data1','data2'].sum()

      data1  data2
key1
a        16      6
b         8      4

In [178]:
datas=data.groupby(['key1','key2'])['data1','data2'].sum().unstack()
datas

     data1     data2
key2   one two   one two
key1
a       10   6     4   2
b        6   2     2   2

In [179]:
datas['data1']

key2  one  two
key1
a      10    6
b       6    2

In [180]:
datas.loc[:,'data1']['one']

key1
a    10
b     6
Name: one, dtype: int32

In [181]:
data['data1'].groupby([data['key1']]).sum()

key1
a    16
b     8
Name: data1, dtype: int32

# Pandas聚合之apply

In [183]:
df1=DataFrame(np.random.randint(1,9,(4,4)),columns=list('abcd'))
df1

   a  b  c  d
0  7  5  5  8
1  2  6  2  1
2  7  5  7  8
3  4  3  5  2

In [184]:
df1.apply(lambda x:x*10)

    a   b   c   d
0  70  50  50  80
1  20  60  20  10
2  70  50  70  80
3  40  30  50  20

In [185]:
df1['a'].apply(lambda x:x*10)

0    70
1    20
2    70
3    40
Name: a, dtype: int64

In [186]:
df1.apply(lambda x:x*10,axis=1)

    a   b   c   d
0  70  50  50  80
1  20  60  20  10
2  70  50  70  80
3  40  30  50  20

In [187]:
df1.loc[0:2].apply(lambda x:x*10)

    a   b   c   d
0  70  50  50  80
1  20  60  20  10
2  70  50  70  80

In [188]:
def f1(x):
    return x+10
df1.apply(f1)

    a   b   c   d
0  17  15  15  18
1  12  16  12  11
2  17  15  17  18
3  14  13  15  12

In [189]:
df1[['b','c']].apply(f1)

    b   c
0  15  15
1  16  12
2  15  17
3  13  15

In [190]:
df1.apply(f1,axis=1)

    a   b   c   d
0  17  15  15  18
1  12  16  12  11
2  17  15  17  18
3  14  13  15  12

In [191]:
df1.loc[2:3].apply(f1)

    a   b   c   d
2  17  15  17  18
3  14  13  15  12

In [196]:
# 求平均值
def means1(x):
    return x.mean()
def means2(x):
    return Series(x.mean())
# 求和
def sum1(x):
    return x.sum()
def sum2(x):
    return Series(x.sum())
# 求最大值与最小值的差
def diff(x):
    return x.max()-x.min()

In [198]:
re=df1.apply(means1)
print(type(re))
re

<class 'pandas.core.series.Series'>

a    5.00
b    4.75
c    4.75
d    4.75
dtype: float64

In [199]:
re=df1.apply(means2)
print(type(re))
re

<class 'pandas.core.frame.DataFrame'>

     a     b     c     d
0  5.0  4.75  4.75  4.75

In [200]:
re=df1.apply(sum1)
print(type(re))
re

<class 'pandas.core.series.Series'>

a    20
b    19
c    19
d    19
dtype: int64

In [201]:
re=df1.apply(sum2)
print(type(re))
re

<class 'pandas.core.frame.DataFrame'>

    a   b   c   d
0  20  19  19  19

In [202]:
df1.apply(diff)

a    5
b    3
c    5
d    7
dtype: int64

In [122]:
# 自定义操作——字符串拼接
data=np.random.randint(1,10,(4,4))
df1=DataFrame(data,columns=['a','b','c','d'])
# 第一个参数代表传入的每一个元素，第二个参数表示传入的参数
def f4(x,suffixs,suffix2):   
    return str(x)+suffixs+suffix2
df1

   a  b  c  d
0  3  1  7  1
1  9  4  3  6
2  2  5  2  7
3  8  4  5  9

In [123]:
# 通过args传入参数元组
df1['a'].apply(f4,args=('班','级'))

0    3班级
1    9班级
2    2班级
3    8班级
Name: a, dtype: object

# Pandas之数据透视

In [205]:
'''
    数据透视表pivot_table，根据一个或多个键进行聚合，
    并根据行列上的分组键将数据分配到各个矩形区域中。
'''
data=DataFrame({
    'data1':np.random.randint(1,9,5),
    'data2':np.random.randint(1,9,5),
    'key1':list('aabba'),
    'key2':['one','one','two','one','two']
})
data

   data1  data2 key1 key2
0      8      6    a  one
1      4      4    a  one
2      5      2    b  two
3      6      8    b  one
4      6      3    a  two

In [206]:
'''
    data: DataFrame对象
    values: 显示的列的名字，可以应用aggfunc中的函数
    index: 索引
    columns: 可选的， 通过额外的方法来分割你所关心的实际值
    aggfunc被应用到values上, aggfunc默认的是mean
'''
data.pivot_table(values=['data1','data2'],
                 index=['key1'],
                 columns=['key2'],
                 aggfunc=np.mean)

     data1     data2
key2   one two   one two
key1
a        6   6     5   3
b        6   5     8   2

In [124]:
df=DataFrame({
    'score':[70,60,50,80,99],
    'grade':['one','two','one','two','one'],
    'class':['lib','sci','lib','lib','sci']
})
df

   score grade class
0     70   one   lib
1     60   two   sci
2     50   one   lib
3     80   two   lib
4     99   one   sci

In [125]:
# 求每个年级的分数总和
df.pivot_table(values='score',index='grade',aggfunc=np.sum)

       score
grade
one      219
two      140

In [126]:
df.groupby('grade')['score'].sum()

grade
one    219
two    140
Name: score, dtype: int64

In [128]:
# 分别获取每个年级文理科的分数总和
df.pivot_table(values='score',
                 index='grade',
                 columns='class',
                 aggfunc=np.sum)

class  lib  sci
grade
one    120   99
two     80   60

In [129]:
df.groupby(['grade','class'])['score'].sum().unstack()

class  lib  sci
grade
one    120   99
two     80   60